tutorials/precursorABL/stable/0.original/qwall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [ 0 1 -1 1 0 0 0 ];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    lower
    {
        type            fixedHeatingRate;
        heatingRate     uniform $heatingRate;
        TSurface        uniform $T0;
        kappa           $kappa;
        z0              uniform $z0;
        betaM           $betaM;
        gammaM          $gammaM;
        betaH           $betaH;
        gammaH          $gammaH;
        alphaH          $alphaH;
        averageType     "planarAverage";
        value           uniform $qwall;
    } 
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    west 
    {
        type            cyclic;
        value           $internalField;
    }
    east 
    {
        type            cyclic;
        value           $internalField;
    }
    north 
    {
        type            cyclic;
        value           $internalField;
    }
    south
    {
        type            cyclic;
        value           $internalField;
    }
}


// ************************************************************************* //
