tutorials/precursorABL/stable/system/fieldAverages
    fieldAverages
    {
        type                 fieldAverage;
        functionObjectLibs   ("libfieldFunctionObjects.so");
        enabled              true;
        outputControl        outputTime;
        timeStart            17000.0;
        fields
        (
            Cs
            {
                mean         on;
                prime2Mean   off;
                base         time;
            }
        );
    }
